## Staging: cognito
**❌ &nbsp; Terraform Format:** `failed`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`


**⚠️ &nbsp; Format:** run `terraform fmt` to fix the following: 
```sh
user_pool.tf
```



**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 2 to add, 1 to change, 2 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cognito_user_pool.forms will be updated in-place
  ~ resource "aws_cognito_user_pool" "forms" {
        id                        = "ca-central-1_Cguq9JNQ1"
        name                      = "forms_user_pool"
        tags                      = {}
        # (10 unchanged attributes hidden)




      ~ password_policy {
          - temporary_password_validity_days = 7 -> null
            # (5 unchanged attributes hidden)
        }

      ~ verification_message_template {
          ~ default_email_option  = "CONFIRM_WITH_LINK" -> "CONFIRM_WITH_CODE"
          + email_message         = "Please confirm your email / S.V.P confirmer votre email {####}"
          + email_subject         = "Please confirm your email for GC Forms / S.V.P confirmer votre email pour GC Formulaire  "
            # (2 unchanged attributes hidden)
        }
        # (3 unchanged blocks hidden)
    }

  # aws_cognito_user_pool_client.forms must be replaced
-/+ resource "aws_cognito_user_pool_client" "forms" {
      - access_token_validity                = 0 -> null
      ~ client_secret                        = (sensitive value)
      ~ enable_token_revocation              = true -> (known after apply)
      ~ generate_secret                      = true -> false # forces replacement
      ~ id                                   = "48nb0can8mi051iiej416bnp8u" -> (known after apply)
      - id_token_validity                    = 0 -> null
      ~ logout_urls                          = [] -> (known after apply)
        name                                 = "forms_client"
      + prevent_user_existence_errors        = (known after apply)
      - read_attributes                      = [] -> null
      - write_attributes                     = [] -> null
        # (8 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret_version.cognito_client_secret must be replaced
-/+ resource "aws_secretsmanager_secret_version" "cognito_client_secret" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:cognito_client_secret-ZjdUZU" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:cognito_client_secret-ZjdUZU|3F87495B-C047-483D-B3DE-A1E05AE2A5CB" -> (known after apply)
      - secret_binary  = (sensitive value)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "3F87495B-C047-483D-B3DE-A1E05AE2A5CB" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.

Changes to Outputs:
  ~ cognito_client_id         = "48nb0can8mi051iiej416bnp8u" -> (known after apply)
  ~ cognito_client_secret_arn = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:cognito_client_secret-ZjdUZU" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cognito_user_pool.forms"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.cognito_client_secret"]

19 tests, 17 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
